package com.example.fook_004_1

import android.content.Intent
import androidx.appcompat.app.AppCompatActivity
import android.os.Bundle
import android.widget.ArrayAdapter
import android.widget.Toast
import kotlinx.android.synthetic.main.activity_main.*

class MainActivity : AppCompatActivity() {

    val titleArr = arrayOf("กระต่าย",
        "เม่นแคระ",
        "สุนัข",
        "โคอาล่า",
        "แมว",
    "เสือจากัวร์",
        "ตุ่นปากเป็ด",
        "ลูกหมี",
        "สล็อต",
        "เต่า",
        "แมวน้ำ")
    val priceArr = arrayOf("กระต่าย (อังกฤษ: Rabbit) เป็นสัตว์ที่จัดอยู่ในไฟลัมสัตว์มีกระดูกสันหลัง ชั้นสัตว์เลี้ยงลูกด้วยนม อันดับกระต่าย (Lagomorpha) ในวงศ์ Leporidae"
    ,"เฮดจ์ฮอก (อังกฤษ: hedgehog) เป็นสัตว์เลี้ยงลูกด้วยน้ำนมขนาดเล็กที่อยู่ในวงศ์ย่อย Erinaceinae ในวงศ์ใหญ่ Erinaceidae มีลักษณะทั่วไปคล้ายกับเม่น ซึ่งเป็นสัตว์ในอันดับสัตว์ฟันแทะ (Rodentia) ซึ่งอยู่กันคนละอันดับกัน คือ ด้านหลังของลำตัวปกคลุมไปด้วยขนที่มีลักษณะแข็งคล้ายหนาม ซึ่งไว้สำหรับป้องกันตัว แต่เฮดจ์ฮอกมีขนาดที่เล็กกว่ามาก และมีหนามที่สั้นกว่ามาก โดยขนของเฮดจ์ฮอกมีลักษณะเล็กแข็งคล้ายเสี้ยนหรือหนามมากกว่า มีส่วนใบหน้าคล้ายหนู แต่มีจมูกที่เรียวยาวที่ขมุบขมิบสำหรับดมกลิ่นอยู่ตลอด และเสดาะเคราะห์ ราศี สิงค์" +
                "","หมา หรือคำสุภาพว่า สุนัข (ชื่อวิทยาศาสตร์: Canis lupus familiaris หรือ Canis familiaris) เป็นสัตว์มีเขี้ยวชนิดเชื่องทีถูกคัดเลือกผสมพันธุ์มาเป็นเวลาพันปีจนมีพฤติกรรม การรับรู้ทางประสาทสัมผัส และลักษณะทางกายภาพที่หลากหลาย" +
                "","โคอาลา (อังกฤษ: koala) เป็นสัตว์เลี้ยงลูกด้วยนมมีกระเป๋าหน้าท้อง จำพวกพอสซัม (ไม่ใช่หมี) ตัวเมียจะมีกระเป๋าหน้าท้อง สำหรับให้ลูกอ่อนอาศัยอยู่ จากการที่มีลักษณะรูปร่างหน้าตาคล้ายสัตว์ในตระกูลหมี ทำให้ส่วนใหญ่นิยมว่า \"หมีโคอาลา\" หรือ \"หมีต้นไม้\"" +
                "","แมว (ชื่อวิทยาศาสตร์: Felis catus) เป็นสัตว์เลี้ยงลูกด้วยนม อยู่ในตระกูล Felidae ต้นตระกูลมาจากเสือไซบีเรีย (Felis tigris altaica) ซึ่งมีช่วงลำตัวตั้งแต่จมูกถึงปลายหางยาวประมาณ 40 เซนติเมตร แมวที่เลี้ยงตามบ้าน จะมีรูปร่างขนาดเล็ก ขนาดลำตัวยาว ช่วงขาสั้นและจัดอยู่ในกลุ่มของประเภทสัตว์กินเนื้อ มีเขี้ยวและเล็บแหลมคมสามารถหดซ่อนเล็บได้เช่นเดียวกับเสือ สืบสายเลือดมาจากแมวป่าที่มีขนาดใหญ่กว่า ซึ่งลักษณะบางอย่างของแมวยังคงพบเห็นได้ในแมวบ้านปัจจุบัน" +
                "","เสือจากัวร์ จัดอยู่ในไฟลัมสัตว์มีแกนสันหลัง ชั้นสัตว์เลี้ยงลูกด้วยน้ำนม อันดับสัตว์กินเนื้อ วงศ์เสือและแมว (Felidae) มีชื่อวิทยาศาสตร์ว่า Panthera onca เป็นเสือขนาด" +
                "","ตุ่นปากเป็ด (อังกฤษ: Platypus, Watermole, Duckbill, Duckmole, Duck-billed platypus) เป็นสัตว์ประจำท้องถิ่นของออสเตรเลีย แม้ว่าตุ่นปากเป็ดจะมีเพียงสปีชีส์เดียว แต่มีชื่อเรียกมากมายหลายชื่อ เช่น และมีชื่อที่ชาวอะบอริจินตั้งให้อีกหลายชื่อ ได้แก่ mallangong, boondaburra และ tambreet พบตุ่นปากเป็ดเฉพาะในแถบตะวันออกของออสเตรเลียเท่านั้น ตุ่นปากเป็ดเป็นสัตว์เลี้ยงลูกด้วยนมในอันดับโมโนทรีมาตา (Monotremata) เช่นเดียวกับอีคิดนา" +
                "","หมีขาว หรือ หมีขั้วโลก (อังกฤษ: polar bear; ชื่อวิทยาศาสตร์: Ursus maritimus) เป็นสัตว์เลี้ยงลูกด้วยน้ำนมในชั้นสัตว์เลี้ยงลูกด้วยน้ำนม ในอันดับสัตว์กินเนื้อ" +
                "","สลอธเป็นสัตว์เลี้ยงลูกด้วยนมที่จัดอยู่ในกลุ่มเดียวกับตัวนิ่มและนางอาย มีถิ่นกำเนิดบริเวณทวีปอเมริกาเหนือ แต่ปัจจุบันพบมากในป่าฝนร้อนชื้นของอเมริกากลางและอเมริกาใต้ พบประมาณ 2 สายพันธุ์หลักคือ สลอธ 2 นิ้วและสลอธ 3 นิ้ว ที่ตอนนี้จัดอยู่ในกลุ่มสัตว์ใกล้สูญพันธุ์" +
                "","เต่า คือ สัตว์จำพวกหนึ่งในอันดับ Testudines จัดอยู่ในจำพวกสัตว์เลือดเย็น ในชั้นสัตว์เลื้อยคลาน เป็นสัตว์ที่มีวิวัฒนาการมาแล้วกว่า 200 ล้านปี" +
                "","วงศ์แมวน้ำแท้ (อังกฤษ: true seal, earless seal) เป็นสัตว์เลี้ยงลูกด้วยนมในวงศ์ใหญ่สัตว์ตีนครีบ ซึ่งแบ่งออกเป็น 3 กลุ่มคือวงศ์ไม่มีใบหู(Phocidae) วงศ์แมวน้ำมีหู (Otariidae) และ วอลรัส (Odobenidae)")
    val context = this
    public final val KEY_TITLE="TITLE"
    public final val KEY_RESULT="RESULT"

    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_main)
        setTitle("รายชื่อสัตว์")
        val mAdp = ArrayAdapter(context,
            android.R.layout.simple_list_item_1,
            titleArr)
        lv_result.adapter = mAdp
        lv_result.setOnItemClickListener { parent, view, position, id ->
//            Toast.makeText(context,
//                "ชื่ออาหาร ${titleArr[position]} ราคา ${priceArr[position]} บาท"
//                ,Toast.LENGTH_LONG).show()
            val goPageResult = Intent(context,Show::class.java)

            goPageResult.putExtra(KEY_TITLE,titleArr[position])
            goPageResult.putExtra(KEY_RESULT,priceArr[position])
            startActivity(goPageResult)
        }

    }
}

